{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "data",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        null,
                        null,
                        1
                    ],
                    "dtype": "float32",
                    "name": "data",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "data"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "bn_data",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "data",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn_data"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_19",
                    "padding": [
                        [
                            3,
                            3
                        ],
                        [
                            3,
                            3
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "bn_data",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_19"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        7,
                        7
                    ],
                    "name": "conv0",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_19",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv0"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "bn0",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn0"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "relu0",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "bn0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "relu0"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_20",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "relu0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_20"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "pooling0",
                    "padding": "valid",
                    "pool_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_20",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "pooling0"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "stage1_unit1_bn1",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "pooling0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_bn1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "stage1_unit1_relu1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_bn1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_relu1"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_21",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_21"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "stage1_unit1_conv1",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_21",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_conv1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "stage1_unit1_bn2",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_bn2"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "stage1_unit1_relu2",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_bn2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_relu2"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_22",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_relu2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_22"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "stage1_unit1_conv2",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_22",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_conv2"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "stage1_unit1_sc",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_sc"
            },
            {
                "class_name": "Add",
                "config": {
                    "dtype": "float32",
                    "name": "add_9",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_conv2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "stage1_unit1_sc",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "add_9"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "stage1_unit2_bn1",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "add_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit2_bn1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "stage1_unit2_relu1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_bn1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit2_relu1"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_23",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_23"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "stage1_unit2_conv1",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_23",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit2_conv1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "stage1_unit2_bn2",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit2_bn2"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "stage1_unit2_relu2",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_bn2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit2_relu2"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_24",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_relu2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_24"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "stage1_unit2_conv2",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_24",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit2_conv2"
            },
            {
                "class_name": "Add",
                "config": {
                    "dtype": "float32",
                    "name": "add_10",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit2_conv2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "add_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "add_10"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "stage1_unit3_bn1",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "add_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit3_bn1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "stage1_unit3_relu1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_bn1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit3_relu1"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_25",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_25"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "stage1_unit3_conv1",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_25",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit3_conv1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "stage1_unit3_bn2",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit3_bn2"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "stage1_unit3_relu2",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_bn2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit3_relu2"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_26",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_relu2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_26"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "stage1_unit3_conv2",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_26",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit3_conv2"
            },
            {
                "class_name": "Add",
                "config": {
                    "dtype": "float32",
                    "name": "add_11",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit3_conv2",
                            0,
                            0,
                            {}
                        ],
                        [
                            "add_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "add_11"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "stage2_unit1_bn1",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "add_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage2_unit1_bn1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "stage2_unit1_relu1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage2_unit1_bn1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage2_unit1_relu1"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_27",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage2_unit1_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_27"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "stage2_unit1_conv1",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_27",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage2_unit1_conv1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "stage2_unit1_bn2",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage2_unit1_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage2_unit1_bn2"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "stage2_unit1_relu2",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage2_unit1_bn2",
                            0,
                            0,
