{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input_5",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        null,
                        null,
                        2
                    ],
                    "dtype": "float32",
                    "name": "input_5",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_5"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_95",
                    "padding": "same",
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "input_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_95"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_95",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_95",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_95"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_95",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_95",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_95"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_96",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_95",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_96"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_96",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_96",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_96"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_96",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_96",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_96"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_97",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_96",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_97"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_97",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_97",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_97"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_97",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_97",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_97"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "max_pooling2d_5",
                    "padding": "same",
                    "pool_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_97",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling2d_5"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 80,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2d_98",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_98"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_98",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_98",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_98"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_98",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_98",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_98"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 192,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_99",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_98",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_99"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_99",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_99",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_99"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_99",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_99",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_99"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "max_pooling2d_6",
                    "padding": "same",
                    "pool_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_99",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling2d_6"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2d_103",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_103"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_103",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_103",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_103"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_103",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_103",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_103"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 48,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2d_101",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_101"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 96,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_104",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_103",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_104"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_101",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_101",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_101"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_104",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_104",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_104"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_101",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_101",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_101"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_104",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_104",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_104"
            },
            {
                "class_name": "AveragePooling2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "average_pooling2d_10",
                    "padding": "same",
                    "pool_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "average_pooling2d_10"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 96,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2d_100",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling2d_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_100"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        5,
                        5
                    ],
                    "name": "conv2d_102",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_101",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_102"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 96,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "name": "conv2d_105",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_104",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_105"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "conv2d_106",
                    "padding": "same",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "average_pooling2d_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv2d_106"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_100",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_100",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_100"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_102",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_102",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_102"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_105",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_105",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_105"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_106",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_106",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_106"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_100",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_100",
