{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "data",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        null,
                        null,
                        2
                    ],
                    "dtype": "float32",
                    "name": "data",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "data"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "bn_data",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "data",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn_data"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_158",
                    "padding": [
                        [
                            3,
                            3
                        ],
                        [
                            3,
                            3
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "bn_data",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_158"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        7,
                        7
                    ],
                    "name": "conv0",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_158",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv0"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "bn0",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn0"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "relu0",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "bn0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "relu0"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_159",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "relu0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_159"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "pooling0",
                    "padding": "valid",
                    "pool_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_159",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "pooling0"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "stage1_unit1_conv1",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "pooling0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_conv1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "stage1_unit1_bn1",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_bn1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "stage1_unit1_relu1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_bn1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_relu1"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_160",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_160"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_1",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_1"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_2",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_2"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_3",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_3"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_4",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_4"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_5",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_5"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_6",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_6"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_7",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_7"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_8",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_8"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_9",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_9"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_10",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_10"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_11",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_11"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_12",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_12"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_13",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_13"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_14",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_14"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_15",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_15"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_16",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_16"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_17",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_17"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_18",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_18"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_19",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_19"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_20",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_20"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_21",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_21"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_22",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_22"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_23",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_23"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_24",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_24"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_25",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_25"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_26",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_26"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_27",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_160",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_27"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
