{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "data",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        null,
                        null,
                        2
                    ],
                    "dtype": "float32",
                    "name": "data",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "data"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "bn_data",
                    "scale": false,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "data",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn_data"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_176",
                    "padding": [
                        [
                            3,
                            3
                        ],
                        [
                            3,
                            3
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "bn_data",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_176"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        7,
                        7
                    ],
                    "name": "conv0",
                    "padding": "valid",
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_176",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv0"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "bn0",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "bn0"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "relu0",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "bn0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "relu0"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_177",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "relu0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_177"
            },
            {
                "class_name": "MaxPooling2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "pooling0",
                    "padding": "valid",
                    "pool_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_177",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "pooling0"
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1,
                        1
                    ],
                    "name": "stage1_unit1_conv1",
                    "padding": "valid",
                    "strides": [
                        1,
                        1
                    ],
                    "trainable": true,
                    "use_bias": false
                },
                "inbound_nodes": [
                    [
                        [
                            "pooling0",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_conv1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": 3,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 2e-05,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "stage1_unit1_bn1",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_bn1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "stage1_unit1_relu1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_bn1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "stage1_unit1_relu1"
            },
            {
                "class_name": "ZeroPadding2D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "zero_padding2d_178",
                    "padding": [
                        [
                            1,
                            1
                        ],
                        [
                            1,
                            1
                        ]
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "stage1_unit1_relu1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "zero_padding2d_178"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_513",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_513"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_514",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_514"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_515",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_515"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_516",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_516"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_517",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_517"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_518",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_518"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_519",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_519"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_520",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_520"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_521",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_521"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_522",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_522"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_523",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_523"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_524",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_524"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_525",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_525"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_526",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_526"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_527",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_527"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_528",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_528"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_529",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_529"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_530",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_530"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_531",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_531"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_532",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_532"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_533",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_533"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_534",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_534"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_535",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_535"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_536",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_536"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_537",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_537"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_538",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_538"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
                        "4wEAAAAAAAAAAQAAAAcAAAATAAAAcywAAAB8AGQAZACFAmQAZACFAmQAZACFAogAiAEUAIgAZAEX\nAIgBFACFAmYEGQBTACkCTukBAAAAqQApAdoBeikC2gFj2hBncm91cGVkX2NoYW5uZWxzcgIAAAD6\ney9ob21lL2tpbGdvcmV0cm91dC9VTmV0UGx1c1BsdXMvc2VnbWVudGF0aW9uX21vZGVscy9iYWNr\nYm9uZXMvY2xhc3NpZmljYXRpb25fbW9kZWxzL2NsYXNzaWZpY2F0aW9uX21vZGVscy9yZXNuZXh0\nL2Jsb2Nrcy5wedoIPGxhbWJkYT4eAAAA8wAAAAA=\n",
                        null,
                        [
                            31,
                            4
                        ]
                    ],
                    "function_type": "lambda",
                    "name": "lambda_539",
                    "output_shape": null,
                    "output_shape_type": "raw",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "zero_padding2d_178",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "lambda_539"
            },
            {
                "class_name": "Lambda",
                "config": {
                    "arguments": {},
                    "dtype": "float32",
                    "function": [
