{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input_3",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        128,
                        64
                    ],
                    "dtype": "float32",
                    "name": "input_3",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_3"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        7
                    ],
                    "name": "conv1d_4",
                    "padding": "same",
                    "strides": [
                        2
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_4"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_1",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_1"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_1"
            },
            {
                "class_name": "MaxPooling1D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "max_pooling1d_1",
                    "padding": "same",
                    "pool_size": [
                        3
                    ],
                    "strides": [
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling1d_1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_2",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_2"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_2",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_2"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_5",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_5"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_3",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_3"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_3",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_3"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_6",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_6"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_1",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_1"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_4",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_4"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_4",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_4"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_7",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_7"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_5",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_5"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_5",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_5"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_8",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_8"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_2",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_6",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_2"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_6",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_6"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_6",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_6"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_9",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_9"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_7",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_7"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_7",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_7"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_10",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_10"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_3",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_6",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_8",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_3"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_8",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_8"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_8",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_8"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_11",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_11"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_9",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_9"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_9",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_9"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_12",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_12"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_4",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_6",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_8",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_10",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_12",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_4"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_10",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_10"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_10",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_10"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_13",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_13"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_11",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_13",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_11"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_11",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_11"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_14",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_14"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_5",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_6",
