{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input_5",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        128,
                        64
                    ],
                    "dtype": "float32",
                    "name": "input_5",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_5"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        7
                    ],
                    "name": "conv1d_292",
                    "padding": "same",
                    "strides": [
                        2
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_292"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_291",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_292",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_291"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_291",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_291",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_291"
            },
            {
                "class_name": "MaxPooling1D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "max_pooling1d_3",
                    "padding": "same",
                    "pool_size": [
                        3
                    ],
                    "strides": [
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_291",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling1d_3"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_292",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_292"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_292",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_292",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_292"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_293",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_292",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_293"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_293",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_293",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_293"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_293",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_293",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_293"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_294",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_293",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_294"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_141",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_3",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_294",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_141"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_294",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_141",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_294"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_294",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_294",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_294"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_295",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_294",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_295"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_295",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_295",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_295"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_295",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_295",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_295"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_296",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_295",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_296"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_142",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_3",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_294",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_296",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_142"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_296",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_142",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_296"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_296",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_296",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_296"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_297",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_296",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_297"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_297",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_297",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_297"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_297",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_297",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_297"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_298",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_297",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_298"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_143",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_3",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_294",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_296",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_298",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_143"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_298",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_143",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_298"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_298",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_298",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_298"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_299",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_298",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_299"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_299",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_299",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_299"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_299",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_299",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_299"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_300",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_299",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_300"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_144",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_3",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_294",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_296",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_298",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_300",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_144"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_300",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_144",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_300"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_300",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_300",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_300"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_301",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_300",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_301"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_301",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_301",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_301"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_301",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_301",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_301"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_302",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_301",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_302"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_145",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
