{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input_6",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        128,
                        64
                    ],
                    "dtype": "float32",
                    "name": "input_6",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_6"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        7
                    ],
                    "name": "conv1d_492",
                    "padding": "same",
                    "strides": [
                        2
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_492"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_492",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_492",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_492"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_492",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_492",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_492"
            },
            {
                "class_name": "MaxPooling1D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "max_pooling1d_4",
                    "padding": "same",
                    "pool_size": [
                        3
                    ],
                    "strides": [
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_492",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "max_pooling1d_4"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_493",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_493"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_493",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_493",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_493"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_493",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_493",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_493"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_494",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_493",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_494"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_494",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_494",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_494"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_494",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_494",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_494"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_239",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_4",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_494",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_239"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_495",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_239",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_495"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_495",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_495",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_495"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_495",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_495",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_495"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_496",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_495",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_496"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_496",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_496",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_496"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_496",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_496",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_496"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_240",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_4",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_494",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_496",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_240"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_497",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_240",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_497"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_497",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_497",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_497"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_497",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_497",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_497"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_498",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_497",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_498"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_498",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_498",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_498"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_498",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_498",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_498"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_241",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_4",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_494",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_496",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_498",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_241"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_499",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_241",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_499"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_499",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_499",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_499"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_499",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_499",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_499"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_500",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_499",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_500"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_500",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_500",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_500"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_500",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_500",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_500"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_242",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "max_pooling1d_4",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_494",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_496",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_498",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv1d_500",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "concatenate_242"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_501",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_242",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_501"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_501",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_501",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_501"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        1
                    ],
                    "name": "conv1d_501",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_501",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_501"
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "axis": -1,
                    "beta_constraint": null,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "name": "batch_normalization_502",
                    "scale": true,
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "conv1d_501",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "batch_normalization_502"
            },
            {
                "class_name": "Activation",
                "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_502",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_502",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "activation_502"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "conv1d_502",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "activation_502",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "conv1d_502"
            },
            {
                "class_name": "Concatenate",
                "config": {
                    "axis": -1,
                    "dtype": "float32",
                    "name": "concatenate_243",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
