{
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        128,
                        64
                    ],
                    "dtype": "float32",
                    "name": "input_1",
                    "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_1"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block1_conv1",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block1_conv1"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block1_conv2",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block1_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block1_conv2"
            },
            {
                "class_name": "MaxPooling1D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "block1_pool",
                    "padding": "valid",
                    "pool_size": [
                        2
                    ],
                    "strides": [
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block1_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block1_pool"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block2_conv1",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block1_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block2_conv1"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block2_conv2",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block2_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block2_conv2"
            },
            {
                "class_name": "MaxPooling1D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "block2_pool",
                    "padding": "valid",
                    "pool_size": [
                        2
                    ],
                    "strides": [
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block2_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block2_pool"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block3_conv1",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block2_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block3_conv1"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block3_conv2",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block3_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block3_conv2"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 256,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block3_conv3",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block3_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block3_conv3"
            },
            {
                "class_name": "MaxPooling1D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "block3_pool",
                    "padding": "valid",
                    "pool_size": [
                        2
                    ],
                    "strides": [
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block3_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block3_pool"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block4_conv1",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block3_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block4_conv1"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block4_conv2",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block4_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block4_conv2"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block4_conv3",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block4_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block4_conv3"
            },
            {
                "class_name": "MaxPooling1D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "block4_pool",
                    "padding": "valid",
                    "pool_size": [
                        2
                    ],
                    "strides": [
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block4_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block4_pool"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block5_conv1",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block4_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block5_conv1"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block5_conv2",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block5_conv1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block5_conv2"
            },
            {
                "class_name": "Conv1D",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1
                    ],
                    "dtype": "float32",
                    "filters": 512,
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "kernel_size": [
                        3
                    ],
                    "name": "block5_conv3",
                    "padding": "same",
                    "strides": [
                        1
                    ],
                    "trainable": true,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block5_conv2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block5_conv3"
            },
            {
                "class_name": "MaxPooling1D",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "block5_pool",
                    "padding": "valid",
                    "pool_size": [
                        2
                    ],
                    "strides": [
                        2
                    ],
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block5_conv3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "block5_pool"
            },
            {
                "class_name": "Flatten",
                "config": {
                    "data_format": "channels_last",
                    "dtype": "float32",
                    "name": "flatten",
                    "trainable": true
                },
                "inbound_nodes": [
                    [
                        [
                            "block5_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "flatten"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "fc1",
                    "trainable": true,
                    "units": 512,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "flatten",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fc1"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "relu",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "fc2",
                    "trainable": true,
                    "units": 512,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "fc1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "fc2"
            },
            {
                "class_name": "Dense",
                "config": {
                    "activation": "softmax",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "distribution": "uniform",
                            "mode": "fan_avg",
                            "scale": 1.0,
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "name": "predictions",
                    "trainable": true,
                    "units": 4,
                    "use_bias": true
                },
                "inbound_nodes": [
                    [
                        [
                            "fc2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ],
                "name": "predictions"
            }
        ],
        "name": "vgg16",
        "output_layers": [
            [
                "predictions",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.3.1"
}